; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	infrared0 - mode
	infrared1 - mode
	image2 - mode
	Star1 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star3 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 image2)
	(supports instrument3 infrared0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument4 infrared1)
	(supports instrument4 infrared0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(supports instrument6 infrared0)
	(supports instrument6 image2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image2)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star4)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet7)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star3)
	(supports instrument10 infrared0)
	(calibration_target instrument10 Star1)
	(supports instrument11 infrared1)
	(calibration_target instrument11 Star4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star11)
	(supports instrument12 infrared1)
	(supports instrument12 image2)
	(supports instrument12 infrared0)
	(calibration_target instrument12 GroundStation2)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet7)
	(supports instrument13 image2)
	(supports instrument13 infrared0)
	(calibration_target instrument13 Star3)
	(supports instrument14 infrared1)
	(calibration_target instrument14 GroundStation0)
	(supports instrument15 infrared1)
	(calibration_target instrument15 Star3)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation0)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite2 GroundStation0)
	(pointing satellite3 Phenomenon8)
	(have_image Star5 infrared1)
	(have_image Planet6 infrared1)
	(have_image Planet7 infrared1)
	(have_image Phenomenon8 image2)
	(have_image Star9 infrared0)
	(have_image Planet10 image2)
	(have_image Star11 image2)
))

)

; plan
1. (turn_to satellite3 groundstation0 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 groundstation0)
   goals met: 0 of 10
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 10
3. (calibrate satellite3 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 0 of 10
4. (turn_to satellite3 star11 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 star11)
   goals met: 0 of 10
5. (take_image satellite3 star11 instrument6 image2)
   added: (have_image star11 image2)
   goals met: 1 of 10
6. (turn_to satellite3 planet7 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 planet7)
   goals met: 1 of 10
7. (take_image satellite3 planet7 instrument6 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 2 of 10
8. (turn_to satellite3 planet6 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet6)
   goals met: 2 of 10
9. (take_image satellite3 planet6 instrument6 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 3 of 10
10. (turn_to satellite3 planet10 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 planet10)
   goals met: 3 of 10
11. (turn_to satellite0 star1 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star1)
   goals met: 4 of 10
12. (take_image satellite3 planet10 instrument6 image2)
   added: (have_image planet10 image2)
   goals met: 5 of 10
13. (turn_to satellite2 groundstation0 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation0)
   goals met: 6 of 10
14. (turn_to satellite3 star5 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 star5)
   goals met: 6 of 10
15. (take_image satellite3 star5 instrument6 infrared1)
   added: (have_image star5 infrared1)
   goals met: 7 of 10
16. (turn_to satellite3 star9 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star9)
   goals met: 7 of 10
17. (take_image satellite3 star9 instrument6 infrared0)
   added: (have_image star9 infrared0)
   goals met: 8 of 10
18. (turn_to satellite3 phenomenon8 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 phenomenon8)
   goals met: 9 of 10
19. (take_image satellite3 phenomenon8 instrument6 image2)
   added: (have_image phenomenon8 image2)
   goals met: 10 of 10
